FROM node:latest
RUN apt-get update
RUN apt-get -y install vim

RUN npm install -g typescript ts-node-dev @types/node 
# RUN nodemon http-server pm2  @angular/cli 

ENV PATH=/app/node_modules/.bin:$PATH
ENV NODE_ENV=development
WORKDIR /root/.vscode-server/data/Machine/
COPY vscode_settings/settings.json .

WORKDIR /app

ENTRYPOINT [ "sh" , "entrypoint.sh" ]
# ENTRYPOINT [ "bash" ]


# אז מה אני רוצה?
# קודם כל פרוייקט של נווד, למה? כי וובפאק מותקן על ידי נווד ולדעתי גם רץ עלידה
# לדעתי גם הקומפיילר של טייפסקריפט רץ על נווד
# הם בטוח רצים על V8
# כי הביינריס שלהם זה לא אי.אקס.אי ולא סי ולא ג'אווה - זה גי.אס
# אז אני רוצה פרוייקט של נווד
# אני רוצה לסדר את העניין עם הכתובת של הnode_modules
# אז שלב ראשון זה ליצור פרוייקט, להתקין התקנה גלובלית מהדוקר פייל,
# והתקנה לוקאלית מהפאקג'.גייסון
# לעשות קומפווס אפ לפרוייקט
# עכשיו בגדול אם יש לי קובץ ג'אווה סקריפט ואי כותב node filename.js
# הוא ירוץ
# הוא לא ירוץ בברווסר כי לברווסר לא יהיו הרשאות לגשת דרך האיג'.טי.אמ.אל
# אז נגיד שאנחנו מריצים סרבר בעזרת - אוקי צריך ללמוד על סרברים, גם אס3 של אמאזון
# - איך הוא יודע שזה סבבה לי שהוא מגיש את כל הקבצים שם לבקשות של הברווסר?
# בכל מקרה אחרי שלמדנו על סרברים של קבצים סטטים, נגיד שהשרת מגיש ג'אווה סקריפט..
# אנחנו רוצים גם להגיש סאסס וטייפסקריפט וrequire ועוד..
# אז צריך באנדלר
# או להשתמש בקומפיילר של טייפסקריפט אבל אז צריך איזשהו פלאגין עם ביינריס של נווד שיאזין לשינויים בקובץ
# כמו nodemon, live-http, webpack-dev-server
# עכשיו סבבה שהוא מאזין, אז הוא סם לה שהשתנה, איך הוא יודע לעשות בילד של הקומפיילר של טייפסקריפט?
# או שזה משהו שאפשר להגדיר - שזה כנראה הקטע הכי מעניין בכל הפרוייקט
# או להשתמש במשהו דיפולטיבי
# צריך ללמוד עוד על nodemon
# https://stackoverflow.com/questions/61127690/how-to-watch-and-re-run-typescript-on-change
# יש משהו שנקרא ts-node-dev
# כיוון שני כנראה נכון יותר הוא כן להשתמש בwebpack
# בגלל כל מיני מקרי קצה, השאלה היא האם צריך עכשיו להגדיר לוודרים ופלאגינים להכל?
# לדעתי בתוך התחלה נגיע למצב הרצוי מבחינת הנווד ואז נריץ webpack-dev-server
# לפי ערכים דיפלטיבים
# גם נראה מה כתוב בwebpack.config.json
# וגם יכול להיות שזה פשוט יעבוד
# אחרי זה לגמרי אפשר לבדוק את התשובה מהסטאק אוברפלוו


